{"IT403": {"Topic": "Statistics and Data Analysis", "Info": "Introduction to univariate data analysis methods. Descriptive statistics and data visualization methods. Overview of sampling techniques for data collection, and introduction to statistical inference methods for decision making including simple linear regression, estimation procedures using confidence intervals and hypothesis testing. PREREQUISITE(S): None"}, "CSC412": {"Topic": "Tools and Techniques for Computational Analysis", "Info": "Use of mathematical software to explore basic concepts in linear algebra and calculus.  Scripting for symbolic and computational processing.  Emphasis is on applications in computer science, finance, data mining, and computer vision. PREREQUISITE(S): None"}, "CSC401": {"Topic": "Introduction to Programming", "Info": "An introduction to programming with a focus on problem solving, structured programming, and algorithm design. Concepts covered include data types, expressions, variables, assignments, conditional and iterative structures, functions, file input/output, exceptions, arrays and an introduction to user-defined classes."}, "DSC450": {"Topic": "Database Processing for Large-Scale Analytics", "Info": "The course covers core concepts of database systems with focus on applications in large-scale analytics. Topics include relational databases, scheme normalization, SQL queries for data integration and data cleaning, database programming for ETL, and nontraditional database systems for unstructured data."}, "DSC423": {"Topic": "Data Analysis and Regression", "Info": "Multiple regression and correlation, residual analysis, analysis of variance, and robustness. These topics will be studied from a data analytic perspective, supported by an investigation of available statistical software."}, "DSC424": {"Topic": "Advanced Data Analysis", "Info": "The course will teach advanced statistical techniques to discover information from large sets of data.  The course topics include visualization techniques to summarize and display high dimensional data, dimensional reduction techniques such as principal component analysis and factor analysis, clustering techniques for discovering patterns from large datasets, and classification techniques for decision making.  The methods will be implemented using standard computer packages."}, "DSC430": {"Topic": "Python Programming", "Info": "This course builds the skills necessary to use Python to develop larger programs and libraries. Students will learn to design, implement and debug Python functions and programs, including stochastic and object-oriented techniques. The course will cover Python data structures, and Python facilities for working with files, strings, regular expressions, databases and URLs. The course will also include an introduction to the Pandas package for data management, the NumPy package for scientific computing, and the Matplotlib package for visualization."}, "DSC441": {"Topic": "Fundamentals of Data Science", "Info": "An introduction to the Knowledge Discovery Technologies covering all stages of a data mining process: domain understanding, data collection and selection, data cleaning and transformation, dimensionality reduction, pattern discovery, evaluation, and knowledge extraction. The course provides a comprehensive overview of data mining techniques used to realize these stages, including traditional statistical analysis and machine learning techniques. Students will analyze large datasets and develop modeling solutions to support decision making in various domains such as healthcare, finance, security, marketing, customer relationship management (CRM), and multimedia."}, "DSC465": {"Topic": "Data Visualization", "Info": "An introduction to data visualization techniques to enhance the exploration and analysis of large data sets from a wide range of fields including commercial, financial, medical, scientific and engineering applications. Topics include visual encoding of numeric data, graphical integrity and effective visualization design, visualizing distributions and correlation, false-color techniques for feature extraction and enhancement, basic network visualization and graph layout, isosurface generation, geospatial visualization and volumetric rendering techniques. The course explores both existing visualization software packages and code interfaces for data visualization."}, "DSC480": {"Topic": "Social Network Analysis", "Info": "This course is an introduction to the concepts and methods of social network analysis. Students will learn to extract and manage data about network structure and dynamics, and to analyze, model and visualize such data. Students will use software tools to model and visualize network structure and dynamics. Specific network applications to be discussed include online social networks, collaboration networks, and communication networks."}, "DSC478": {"Topic": "Programming Machine Learning Applications", "Info": "The course will focus on the implementations of various data mining and machine learning techniques using a high-level programming language.  Students will have hands on experience developing both supervised and unsupervised machine learning algorithms and will learn how to employ these techniques in the context of popular applications including automatic personalization, recommender systems, searching and ranking, text mining, group and community discovery, and social media analytics."}, "CSC555": {"Topic": "Mining Big Data", "Info": "Introduction to fundamentals of distributed file systems and map-reduce technology (e.g., Hadoop); tuning map-reduce performance in a distributed network. Algorithms and tools for mining massive data sets and discussion of current challenges. Applications in clustering, similarity search, classification, data warehousing (e.g., Hive), machine learning (e.g., Mahout)."}, "DSC540": {"Topic": "Advanced Machine Learning", "Info": "The course is for students with prior background in data mining or machine learning techniques, and covers more advanced modeling techniques, including ensemble learning, extended linear models such as support vector machines, probabilistic graphical models, mixture and latent variable models, matrix factorization and link analysis.  Application of the models will be presented in popular domains such as Web and social media analytics, text mining, crime analysis, community discovery, and health informatics."}, "CSC521": {"Topic": "Monte Carlo Algorithms", "Info": "A course about the use of random numbers for numerical computation with particular emphasis on implementation issues and applications in science and finance. Covered topics include: pseudo random number generators, the inversion method, the accept-reject method, discrete event simulations, multi-dimensional integration, the Metropolis and the Bootstrap algorithms."}, "CSC575": {"Topic": "Intelligent Information Retrieval", "Info": "Examination of the design, implementation, and evaluation of information retrieval systems. The focus is on the underlying retrieval models, algorithms, and system implementations. Also examined is how an effective information search and retrieval is interrelated with the organization and description of information to be retrieved. Topics include: automatic indexing; thesaurus generation; Boolean, vector-space, and probabilistic models; clustering and classification; information filtering; distributed IR on the WWW; intelligent information agents; IR system evaluation; information visualization; and natural language processing in IR. Throughout the course, current literature from the viewpoints of both research and practical retrieval technologies both on and off the World Wide Web will be examined.  PREREQUISITE(S):  CSC 403"}, "CSC578": {"Topic": "Neural Networks and Deep Learning", "Info": "Course focuses on the algorithms, implement, and application of neural networks for learning about data. It will present how neural networks represent data and learn in supervised and unsupervised contexts with applications to language processing, classification, and regression problems. Topics include learning algorithms, and optimization methods, deep learning methods for deriving deep representations from surface features, recursive networks, Boltzmann machines and convolutional networks."}, "DSC425": {"Topic": "Time Series Analysis and Forecasting", "Info": "The course introduces students to statistical models for time series analysis and forecasting. The course topics include: autocorrelated data analysis, Box-Jenkins models (autoregressive, moving average, and autoregressive moving average models), analysis of seasonality, volatility models (GARCH-type, GARCH-M type, etc.), forecasting evaluation and diagnostics checking. The course will emphasize applications to financial data, volatility modeling and risk management. Real examples will be used throughout the course."}, "DSC433": {"Topic": "Scripting for Data Analysis", "Info": "Data access and transformation with modern statistical software such as SAS and R.  Report writing, data graphing and visualization, writing macros and functions to automate tasks and statistical analyses."}, "CSC452": {"Topic": "Database Programming", "Info": "Programming in a large-scale relational database environment using procedural languages. Topics covered in the course include: procedural extension of query languages, runtime error handling, subprograms (procedures and functions), packages, database triggers, dynamic query language. Optional topics include transaction management, reliability, and security."}, "CSC481": {"Topic": "Introduction to Image Processing", "Info": "The course is a prerequisite for more advanced Visual Computing (VC) courses and the students will be challenged to implement VC algorithms for real world applications.  The topics covered in the course include: components of an image processing system and its applications, elements of visual perception, sampling and quantization, image enhancement by histogram equalization, color spaces and transformations, introduction to segmentation (Edge detection), and morphological image processing.  PREREQUISITE(S): CSC 412 or consent of instructor"}, "CSC482": {"Topic": "Applied Image Analysis", "Info": "Image analysis from classical computational imaging techniques to deep learning techniques. Fundamentals of computational image analysis in terms of image information extraction and modeling of image patterns. Specific topics include, but are not limited to: image segmentation, multi-scale representation, shape analysis, texture analysis, Fourier analysis, wavelets, Gabor and fractal analysis, and template matching. Deep learning models to extract image representations automatically. Classical and deep learning imaging techniques applied and compared in the context of different image analysis tasks such as image representation, segmentation, classification, retrieval, and object recognition. Applications of these techniques for autonomous driving, biometrics, sports analytics, smart and connected communities, and biomedical and health informatics. PREREQUISITE(S) CSC 481"}, "DSC484": {"Topic": "Web Data Mining", "Info": "An in-depth study of the knowledge discovery process and its applications in Web mining, Web analytics and business intelligence.  The course provides coverage of various aspects of data collection and preprocessing, as well as basic data mining techniques for segmentation, classification, predictive modeling, association analysis, and sequential pattern discovery.  The primary focus of the course is the application of these techniques to Web analytics, user behavior modeling, e-metrics for business intelligence, Web personalization and recommender systems.  Also addressed are privacy and ethical issues related to Web data mining.  Students can choose from three types of final course projects: implementation projects, research papers, or data analysis projects.  Throughout the course, the students will learn and use a variety of data mining tools to analyze sample data sets as part of class assignments."}, "CSC528": {"Topic": "Computer Vision", "Info": "Introduction to computer vision, including fundamentals of image formation, camera imaging geometry, feature detection and matching, stereo, and motion analysis. Basic methods and modern deep learning models for applications that include camera calibration, depth recovery from video, motion estimation and tracking, image and video, image search, and new image generation. Focus on the mathematics of these methods and models.  Development of modern techniques such as convolutional neural networks for optical flow estimation and object detection, and generative adversarial networks for artificial image generation. PREREQUISITE(S): CSC 481"}, "DSC510": {"Topic": "Health Data Science", "Info": "The course will focus on data science methods used in clinical studies and public health applications. Students will be introduced to a variety of health care data from electronic health records to payer data, geospational and unstructured data, and will learn how to solve data science problems in the health sector. Topics include overview of healthcare analytics and typical research questions, epidemiology, data ethics, governance and security, applications of modeling techniques and machine learning methods to a variety of case studies in health care."}, "CSC543": {"Topic": "Spatial Databases and Geographic Information Systems", "Info": "This course considers how spatial databases work within a GIS, how data is structured, stored, indexed, retrieved, and displayed.  Other topics may include fuzzy spatial databases, temporal spatial databases, and multiple criteria spatial decision making. The class will consist of hands-on work with commercial products, as well as investigating the state of-the art research in the field.  Prerequisites: CSC 453 or CSC 455"}, "CSC576": {"Topic": "Computational Advertising", "Info": "Computational advertising is the problem of finding the best advertisement for a given user in a given on-line context. It is a complex and emerging area at the intersection of quantitative marketing, web search, data mining, recommendation, optimization, and algorithmic game theory. Students will read current scientific papers and explore a range of models both mathematically and empirically. Students can choose from three types of final course projects: implementation projects, research papers, or data analysis projects. Prerequisite(s): IS 467 or CSC 478 or ECT 584"}, "CSC577": {"Topic": "Recommender Systems", "Info": "Recommender systems offer personalized access to online information in product catalogs, social media networks, and document collections, among other applications. This class will introduce students to a range of approaches for building recommender systems including collaborative, content-based, knowledge-based, and hybrid methods. Students will implement recommendation algorithms using an open-sourced toolkit and conduct experimental evaluations.  PREREQUISITE(S): (CSC 412 and CSC 478) or (CSC 403 and IS 467)"}, "CSC594": {"Topic": "Topics in Artificial Intelligence", "Info": "Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.  PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)"}, "CSC598": {"Topic": "Topics in Data Analysis", "Info": "Specific topics will be selected by the instructor and may vary with each quarter. Can be repeated for credit. Variable credit.  PREREQUISITE(S): For specific prerequisites, see syllabus or consult course instructor. (variable credit)"}, "GEO441": {"Topic": "Geographic Information Systems (Gis) for Community Development", "Info": "This course will focus on applications of Geographic Information Systems (GIS) to community studies and community development. As an amalgam of information technologies (e.g. database management, Web 2.0) and earth measurement technologies (e.g. global positioning systems, remote sensing), GIS is rapidly entering the realm of community development. The course will explain how GIS works; enable students to learn techniques including mapping, spatial analysis, and data management; and provide students with the opportunity to apply GIS to community development. Cross-listed with MPS 552."}, "GEO442": {"Topic": "Geographical Information Systems (Gis) for Sustainable Urban Development", "Info": "An intermediate-level GIS course focusing on the application of GIS skills to real-world problems. Students as a group will conduct GIS projects that are proposed by community-based organizations (CBOs) that work towards promoting sustainability in Chicagoland. Topics include remote sensing, GPS, geocoding, hot spot detection, spatial interpolation, and network analysis. The course also explores case studies on using GIS for sustainable urban development. PREREQUISITE(S): GEO 441 or MPS 552 (GIS for Community Development). GEO 441 or MPS 552 or instructor permission is a prerequisite for this course."}, "GPH565": {"Topic": "Designing for Visualization", "Info": "Sources of graphical integrity and sophistication.  Data-Ink maximization.  Data density. The use of color to enhance features in data sets and the communication of information .  Effective use of space and time.  Use of 3D techniques to display multi-dimensional data.  The use of isosurfaces and volumetric techniques to display features of data sets.  Students will use a programmable system to produce their visualizations and will learn how to use procedural techniques to express graphical intent.  (Only one of GPH 570 and GPH 565 may be taken for credit) Prerequisite(s): GPH 448 and HCI 470"}, "HCI512": {"Topic": "Information Visualization and Infographics", "Info": "Communicating information through visualizations. Students learn how to choose effective means to visualize data for (a) their intended audience(s) and (b) for the message they intend to communicate. Students practice creating and evaluating visualizations using a variety of tools and methods."}, "IPD451": {"Topic": "Big Data and NoSQL Program", "Info": "A 11-week certificate program covering popular NoSQL databases and how they fit with Big Data. This program requires a separate application for admission and $40 application fee. Please visit IPD.CDM.DEPAUL.EDU for information on how to enroll."}, "IS549": {"Topic": "Data Warehousing", "Info": "Introduction to data warehousing and the foundations of understanding the issues involved in building a successful data warehouse. Data warehouse development methodology and issues surrounding the planning of the data warehouse. Data quality and metadata in the data warehouse. Analysis, transformation and loading of data into a data warehouse. Development of the data architecture and physical design. Implementation and administration of the data warehouse.  PREREQUISTE(S): CSC 451 or CSC 453 or CSC 455"}, "IS550": {"Topic": "Enterprise Data Management", "Info": "This course focuses on the technical concepts and managerial knowledge needed to define, integrate and govern centralized and distributed data for a wide range of application systems used at large, multinational corporations. Topics include data repository, data life cycle, DAMA-DMBOK, data stewardship, data asset valuation, enterprise data architecture, data modeling with meta-data, data security standards, master data, and data quality management."}, "IS574": {"Topic": "Business Intelligence and Analytics Systems", "Info": "Introduction to the systems concept of business intelligence and analytics as components of a portfolio of information systems. How business problems can be solved strategically by implementing a portfolio of business intelligence and analytics systems including data lake, data warehouse, data discovery and visualization tools to gain new insights into organizational operations. Detailed discussions of the analysis, design, and implementation of business intelligence and analytics systems, including infrastructure for data management, portfolio management of technology life cycle, and alignment between corporate and local-unit needs. Case studies of application software, cloud resources, change management, as well as technical and social issues."}, "MGT559": {"Topic": "Health Sector Management", "Info": "This graduate level, hands-on course will discuss the evolution and current trends in the delivery and financing of health goods and services in the biotechnology, pharmaceutical, medical device, and health services delivery industries within the health sector. This course will equip students with the ability to use managerial epidemiology as a decision- making tool in marketing and operations in the health sector. Ultimately, this course will enable students to apply Michael Porter's Five Forces Model to analyze and manage the various industries within the health sector. This course will use lectures, role plays, simulations, and the case method."}, "MKT555": {"Topic": "Marketing Management", "Info": "Students are provided with an overview of the marketing process for consumer-oriented firms.  Focus is placed on decision-making that aligns a firm's market offerings with the wants and needs of targeted segments of customers within a continuously changing environment.  Written cases/projects are part of the course assignment."}, "MKT530": {"Topic": "Customer Relationship Management", "Info": "Students are introduced to a new strategic methodology, Customer Relationship Management, which is currently being adopted by many organizations in efforts to enhance their competitive advantage. Focus is placed on understanding how enhanced customer relationships will differentiate an organization in a highly competitive marketplace.  Both business and consumer markets are examined and discussed during this highly interactive class. Relevant guest speakers will share their experiences and current best practices. Case analysis and group projects supplement the class discussions. MKT 555 is a prerequisite for this course. MKT 555 is a prerequisite for this class."}, "MKT534": {"Topic": "Analytical Tools for Marketers", "Info": "This course seeks to provide an in-depth understanding of both qualitative and quantitative analytical tools that are of critical importance to marketers.  These tools will help marketers avoid head-to-head competition, understand customer perceptions, understand customer preferences, develop accurate sales forecasts, and financially value marketing strategies.  The course is designed to be \"hands-on\" in that students will develop understanding mainly through conducting application projects and presenting results.  The course is also designed to be immediately applicable to marketers' current and future jobs. MKT 555 is a Prerequisite for this course MKT 555 is a prerequisite for this class."}, "MKT595": {"Topic": "Digital Marketing Analytics and Planning", "Info": "Explores the emerging business models, rules, tactics, and strategies associated with this medium.  Integration with other channels and marketing operations is stressed.  Classes are discussion-based, drawing on current applied readings and cases from a variety of industries in both the business-to-business and business-consumer markets. MKT 555 is a Prerequisite for this course MKT 555 is a prerequisite for this class."}, "CSC695": {"Topic": "Master's Research", "Info": "Students interested in a more in-depth study of a particular area will register for this course and work with a faculty member (not necessarily their academic advisor) on a research project. The work involved may include system development, empirical studies, or theoretical work. 4 credit hours of CSC 695 replaces one 500level elective course in student's degree program. This course can be taken for 1-4 credit hours for up 8 credit-hours.  PREREQUISITE(S): Consent of research advisor. Independent study form required. Students must successfully complete the foundation courses prior to their first enrollment in CSC 695. (variable credit )"}, "DSC672": {"Topic": "Data Science Capstone", "Info": "The capstone course provides an opportunity for students to integrate and apply the analytics skills and knowledge learned in the classroom to real world data. Students work in teams on a large scale analytics project. At the end of the course, students submit a report summarizing their analyses and study outcomes, and present results to the class. PREREQUISITE(S): Instructor consent required"}, "CSC697": {"Topic": "Graduate Internship", "Info": "In cooperation with local employers, the graduate program offers students the opportunity to integrate their academic experience with on-the-job training in computer related work areas. This course is variable credit and may be taken for one to four credits. This course may be repeated for a maximum of four credits total. Admission to the internship program requires consent of the Instructor and a Student Services Advisor. International students may complete curricular practical training (CPT) through this class provided they first obtain CPT authorization from the Office for International Students and Scholars (OISS) before beginning the internship.  (1 quarter hour)"}, "MGT798": {"Topic": "Special Topics", "Info": "Content and format of this course are variable.  An in-depth study of current issues in management."}, "MKT570": {"Topic": "Service Design and Patient Experience", "Info": "The primary objective of this course is to provide students with in-depth knowledge of how patient experience is impacting health care businesses today, including relationships among patient experience, clinical measures, and operational success. Students will understand the various components of patient experience, identify appropriate metrics for assessing patient experience (CAHPS data, Press Ganey data, Customer Lifetime Value, etc.), and learn to utilize tools for assessing and (re)designing service processes. Working in teams that will be mentored by working professionals in health care, students will develop projects that propose interventions to innovate and improve patient experience metrics. This course will serve as a link between master's level coursework and internships/jobs in health care management, marketing and patient experience. MKT 555 is a prerequisite for this class."}, "MKT798": {"Topic": "Special Topics", "Info": "Content and format of this course is variable.  An in-depth study of current issues in marketing."}}